Repository: brailcom/chem
Catalog: server/locale/brailchem.*.po
Languages: cs, pt, sk

source: Summary formula
cs: Sumární vzorec
pt: Fórmula molecular
sk: Sumárny vzorec

source: Name
cs: Jméno
pt: Nome
sk: Meno

source: %d shared atoms
cs: %d společných atomů
pt: %d átomos partilhados
sk: %d spoločných atómov

source: The ring shares %d atoms with the neighbor ring
cs: Kruh sdílí %d atomů se sousedním kruhem
pt: O anel partilha %d átomos com o anel vizinho
sk: Kruh zdieľa %d atómov so susedným kruhom

source: Result
cs: Výsledek
pt: Resultado
sk: Výsledok

source: Picture
cs: Obrázek
pt: Esquema
sk: Obrázok

source: Picture of the molecule
cs: Obrázek molekuly
pt: Esquema da molécula
sk: Obrázok molekuly

source: Compound name
cs: Jméno sloučeniny
pt: Nome do composto
sk: Meno zlúčeniny

source: Molecular formula
cs: Molekulový vzorec
pt: Fórmula molecular
sk: Molekulový vzorec

source: Charge
cs: Náboj
pt: Carga
sk: Náboj

source: Net charge of the molecule
cs: Celkový náboj molekuly
pt: Carga global da molécula
sk: Celkový náboj molekuly

source: Multiplicity
cs: Multiplicita
sk: Multiplicita

source: Net multiplicity of the molecule
cs: Celková multiplicita molekuly
sk: Celková multiplicita molekuly

source: Molecule encoded in SMILES format
cs: Molekula zapsaná ve formátu SMILES
pt: Molécula codificada no formato SMILES
sk: Molekula zapísaná vo formáte SMILES

source: Molecular weight
cs: Molekulová hmotnost
pt: Peso Molecular
sk: Molekulová hmotnosť

source: Fragments
cs: Fragmenty
pt: Fragmentos
sk: Fragmenty

source: Molecular fragments
cs: Molekulové fragmenty
pt: Fragmentos moleculares
sk: Molekulové fragmenty

source: Atoms
cs: Atomy
pt: Átomos
sk: Atómy

source: Atom
pt: Átomo
sk: Atóm

source: Molecular fragment
cs: Molekulový fragment
pt: Fragmento molecular
sk: Molekulový fragment

source: Reaction
cs: Reakce
pt: Reacção
sk: Reakcia

source: Chemical reaction
cs: Chemická reakce
pt: Reacção química
sk: Chemická reakcia

source: Reactants
cs: Reaktanty
pt: Reagentes
sk: Reaktanty

source: Starting compounds of a reaction
cs: Výchozí sloučeniny reakce
pt: Material de partida da reacção
sk: Východzie zlúčeniny reakcie

source: Reagents
cs: Reagenty
pt: Reagentes químicos
sk: Reagenty

source: Additional components of a reaction - solvent, catalyst, etc.
cs: Další součásti reakce - rozpouštědlo, katalyzátor, etc.
pt: Componentes adicionais da reacção – solvente, catalisador, etc
sk: Ďaľšie súčasti reakcie - rozpúšťadlo, katalyzátor, etc.

source: Products
cs: Produkty
pt: Produtos
sk: Produkty

source: Products of a chemical reaction
cs: Produkty chemické reakce
pt: Produtos de uma reacção química
sk: Produkty chemickej reakcie

source: Reaction components
cs: Reakční složka
pt: Componentes da reacção
sk: Reakčná zložka

source: Components of a chemical reaction
cs: Složka chemické reakce
pt: Componentes de uma reacção química
sk: Zložka chemickej reakcie

source: Molecule
cs: Molekula
pt: Molécula
sk: Molekula

source: Fragment name
cs: Jméno fragmentu
pt: Nome do fragmento
sk: Meno fragmentu

source: Name of the chemical group this fragment represents
cs: Jméno chemické skupiny, kterou tento fragment reprezentuje
pt: Nome do grupo químico representado por este fragmento
sk: Meno chemickej skupiny, ktorú tento fragment reprezentuje

source: Compound type
cs: Typ sloučeniny
pt: Tipo de composto
sk: Typ zlúčeniny

source: Type of compound this fragment represents
cs: Typ sloučeniny, kterou tento fragment reprezentuje
pt: Tipo de composto representado por este fragmento
sk: Typ zlúčeniny, ktorú tento fragment reprezentuje

source: Atom symbol
cs: Symbol atomu
pt: Símbolo atómico
sk: Symbol atómu

source: Element name
cs: Jméno prvku
pt: Nome do elemento
sk: Meno prvku

source: Atom charge
cs: Náboj atomu
pt: Carga do átomo
sk: Náboj atómu

source: Number of unpaired electrons plus one
cs: Počet nezpárovaných elektronů
sk: Počet nespárovaných elektrónov

source: Stereochemistry
cs: Stereochemie
sk: Stereochémia

source: Tetrahedral stereochemistry
cs: Tetrahedrální stereochemie
sk: Tetrahedrálna stereochémia

source: Proton number
cs: Protonové číslo
pt: Número de Protões
sk: Protonové číslo

source: Column
cs: Sloupec
pt: Coluna
sk: Stĺpec

source: Periodic table column
cs: Sloupec periodické tabulky
pt: Coluna da tabela periódica
sk: Stĺpec periodickej tabuľky

source: Row
cs: Řádek
pt: linha
sk: Riadok

source: Periodic table row
cs: Řádek periodické tabulky
pt: Linha da tabela periódica
sk: Riadok periodickej tabuľky

source: Element group
cs: Skupina prvků
pt: Grupo do elemento
sk: Skupina prvkov

source: Valence electrons
cs: Valenční elektrony
pt: Electrões de valência
sk: Valenčné elektróny

source: Number of valence electrons
cs: Počet valenčních elektronů
pt: Número de electrões de valência
sk: Počet valenčných elektrónov

source: Oxidation numbers
cs: Oxidační čísla
pt: Números de oxidação
sk: Oxidačné čísla

source: Possible oxidation numbers for an atom
cs: Možná oxidační čísla atomu
pt: Números de oxidação possíveis para um átomo
sk: Možné oxidačné čísla atómu

source: Electron structure
cs: Elektronová struktura
pt: Estrutura electrónica
sk: Elektronová štruktúra

source: Electron structure of occupied orbitals
cs: Elektronová struktura obsazených orbitalů
pt: Estrutura electrónica das orbitais ocupadas
sk: Elektronová štruktúra obsadených orbitálov

source: Atomic weight
cs: Atomová hmotnost
pt: Peso atómico
sk: Atómová hmotnosť

source: Electronegativity
cs: Elektronegativita
pt: Electronegatividade
sk: Elektronegativita

source: Latin element name
cs: Latinské jméno prvku
pt: Nome do elemento em Latim
sk: Latinské meno prvku

source: Description
cs: Popis
pt: Descrição
sk: Popis

source: Part of rings
cs: Součást kruhů
sk: Súčasť kruhov

source: Of how many rings this atom is part
cs: Kolika kruhů je tento atom součástí
sk: Koľkých kruhov je súčasťou tento atóm

source: Reactant
cs: Reaktant
pt: Reagente
sk: Reaktant

source: Reactant of a reaction
cs: Reaktant reakce
pt: Reagente de uma reacção
sk: Reaktant reakcie

source: Product
cs: Produkt
pt: Produto
sk: Produkt

source: Product of a reaction
cs: Produkt reakce
pt: Produto de uma reacção
sk: Produkt reakcie

source: Single bond
cs: Jednoduchá vazba
pt: Ligação simples
sk: Jednoduchá väzba

source: Double bond
cs: Dvojná vazba
pt: Ligação dupla
sk: Dvojná väzba

source: Triple bond
cs: Trojná vazba
pt: Ligação tripla
sk: Trojná väzba

source: Aromatic bond
cs: Aromatická vazba
pt: Ligação aromática
sk: Aromatická väzba

source: Composed from
cs: Skládá se z
pt: Constituído por
sk: Skladá sa z

source: Reacts with
cs: Reaguje s
pt: Reage com
sk: Reaguje s

source: Produces
cs: Poskytuje
pt: Produz
sk: Poskytuje

source: Produced from
cs: Vytvořeno z
pt: Produzido a partir de
sk: Vytvorené z

source: Opposite to
cs: Na opačné straně
pt: Oposto ao
sk: Na opačnej strane

source: Atom is on opposite side relative to the referenced atom
cs: Atom je na opačné straně vzhledem k odkazovanému atomu
pt: O átomo está no lado oposto em relação ao átomo de referência
sk: Atóm je na opačnej strane vzhľadom k odkazovanému atómu

source: On the same side as
cs: Na stejné straně
pt: Do mesmo lado que
sk: Na rovnakej strane

source: Atom is on the same side relative to the referenced atom
cs: Atom je na stejné straně vzhledem k odkazovanému atomu
pt: O átomo está do mesmo lado em relação ao átomo de referência
sk: Atóm je na rovnakej strane vzhľadom k odkazovanému atómu

source: left
cs: vlevo
sk: vľavo

source: right
cs: vpravo
sk: vpravo

source: Fragment
pt: Fragmento

source: Symbol
pt: Símbolo
