<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd"><html>  <head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">    <title>Úvod do Brailchemu</title>  </head>  <body>    <h1>Úvod do Brailchemu</h1>    <ul>      <li><a href="#what-is-brailchem">&#268;o je Brailchem</a></li>      <li><a href="#usage">Pou&#382;itie</a></li>      <li><a href="#molecule-browser">Prehliada&#269; molekúl</a></li>      <li><a href="#periodic-table">Periodická tabu&#318;ka</a></li>      <li><a href="#keys">Preh&#318;ad klávesových príkazov</a></li>    </ul>        <a name="what-is-brailchem">      <h2>&#268;o je Brailchem</h2>    </a>        <p>      <a href="http://ict.brailcom.org/brailchem">Brailchem</a> je nástroj      u&#318;ah&#269;ujúci &scaron;túdium chémie &#357;a&#382;ko zrakovo postihnutým &scaron;tudentom. Zrakovo postihnutí &scaron;tudenti pri &scaron;túdiu chémie nará&#382;ajú na ve&#318;mi zvlá&scaron;tne &#357;a&#382;kosti ako je potreba porozumie&#357; informáciám oby&#269;ajne prezentovaným graficky vizuálne (napr. &scaron;truktúry organických molekúl) alebo u&#269;eniu sa &scaron;truktúrne komplikovaným vz&#357;ahom bez pou&#382;itia ich vizuálnej prezentácie (napr.periodická tabu&#318;ka prvkov).       Ú&#269;elom Brailchemu je prezentácia chemických informácií s&nbsp;pomocou po&#269;íta&#269;a v&nbsp;, tvare prístupnom      nevidiacim a &#357;a&#382;ko zrakovo postihnutým &scaron;tudentom.    </p>    <p>      Brailchem je vyvíjaný ako sú&#269;as&#357;      <a href="http://ict.brailcom.org">projektu ICT</a>.    </p>    <a name="usage">      <h2>Pou&#382;itie</h2>    </a>    <p>Brailchem obsahuje dve aplikácie: prehliada&#269; molekúl a periodickú tabu&#318;ku prvkov. Tieto aplikácie sa &scaron;tartujú zo&nbsp;zodpovedajúcich polo&#382;iek menu <em>Aplikácie</em>. Ak chcete, mô&#382;ete si spusti&#357; ka&#382;dú z&nbsp;týchto aplikácií v&nbsp;jednom alebo viacerých samostatných oknách, pozri menu <em>Súbor / Nové okno</em>.    </p>    <p>Brailchem je internetová aplikácia. Pozostáva z dvoch &#269;astí: klient a      server.  Server poskytuje klientovi v&scaron;etky chemické údaje a je pre      u&#382;ívate&#318;a &bdquo;neviditelný&ldquo;.  Klient je z&nbsp;chemického h&#318;adiska hlúpy a      nevie ni&#269; o&nbsp;chemických prvkoch a ani &scaron;truktúrach molekúl.  Ide      o&nbsp;&#269;isto prezenta&#269;ný prostriedok pre údaje získané z&nbsp;chemického      serveru. Preto je pre prevádzku klienta potrebné pripojenie k&nbsp;internetu a      prístup k&nbsp;serveru Brailchemu.  Jeden taký server je u&#382; v&nbsp;klientskej aplikácii predvolený, ak sa chcete pripojova&#357; k&nbsp;inému takému serveru, mô&#382;ete si ho nastavi&#357; v&nbsp;nastaveniach Brailchemu.  Pou&#382;ívajte v&scaron;ak iba dôveryhodné servery, v&nbsp;opa&#269;nom prípade by ste sa mohli vystavi&#357; riziku naru&scaron;enia súkromia.    </p>    <p>Pre oboznámenie sa s&nbsp;Brailchemom si prezrite jeho menu, pre&#269;ítajte si dostupného pomocníka a pokúste sa pou&#382;íva&#357; jeho aplikácie.  V&scaron;etky dôle&#382;ité informácie o&nbsp;stave programu a uskuto&#269;nených akciách sú zobrazené v stavovom riadku okna Brailchemu.    </p>          <p>V&nbsp;Brailchemu je definovaný jediný globálny klávesový príkaz:    </p>    <table>      <tr><td><code>Control+Q</code></td><td>zavrie&#357; okno Brailchemu</td></tr>    </table>    <p>Mô&#382;ete samozrejme pou&#382;íva&#357; i&nbsp;klávesy pre prístup k&nbsp;menu. Ostatné klávesové príkazy sú &scaron;pecifické pre jednotlivé aplikácie Brailchemu.</p>    <p>Nasledovné sekcie popisujú jednotlivé aplikácie Brailchemu.</p>        <a name="molecule-browser">      <h2>Prehliada&#269; molekúl</h2>    </a>    <p>Prehliada&#269; molekúl umo&#382;&#328;uje prehliadanie &scaron;truktúr molekúl a chemických reakcií zadaných v&nbsp;niektorom z&nbsp;podporovaných spôsobov zápisu alebo menom molekuly.  Molekula alebo reakcia sa zapí&scaron;e do vstupného polí&#269;ka v&nbsp;aplikácii. Do tohto polí&#269;ka je tie&#382; mo&#382;né uvies&#357; URL miesto, kde se popis molekuly nachádza.  Podporované sú URL protokoly <code>file</code> a <code>http</code>.</p>    </p>    <p>&#270;alej je potrebné v&nbsp;nasledujúcom výberovom tla&#269;idle vybra&#357; formát vstupu a stla&#269;i&#357; tla&#269;idlo na odoslanie. Ak je zadaný vstup v&nbsp;poriadku, je zadaná molekula alebo reakcia obsahujúca nieko&#318;ko molekúl zobrazená v&nbsp;podrobnej forme.</p>    <p>Aplikácia sa pripojuje k&nbsp;serverovej &#269;asti Brailchemu a &#382;iada ho      o&nbsp;informácie zodpovedajúce zadanému vstupu.  Server k&nbsp;zadaným      molekulám vráti zoznam ich atómov a <em>fragmentov</em>.  Fragmenty sú      typické skupiny atómov identifikované serverom (napr. carboxylová      skupina), ktoré mô&#382;u by&#357; prezentované v&nbsp;podobe jedinej polo&#382;ky      namiesto zbyto&#269;ne podrobného zoznamu atómov.</p>    <p>Pre ka&#382;dú molekulu sú zobrazené jej základné vlastnosti (ako sumárny vzorec alebo molekulová hmotnos&#357;) a zoznam atómov a fragmentov. Ka&#382;dý atóm alebo fragment obsahuje objekty, s ktorými je spojený chemickými väzbami. Tieto objekty mô&#382;u by&#357; dvojakého druhu: objekty, ktoré sú susedmi iba tohto jediného atómu (tak&#382;e pre prehliadanie &scaron;truktúry molekuly nie je nutné na nich &#271;alej prechádza&#357;) a&nbsp;objekty, ktoré sú susedmi viacerých atómov.</p>    <p>Niektoré vlastnosti atómov a väzieb majú &scaron;peciálne zna&#269;ky:</p>    <ul>      <li>Ak je atóm sú&#269;as&#357;ou kruhov, je to indikované za symbolom atómu znakom <code>R</code>, pre ka&#382;dý kruh, ktorého je atóm sú&#269;as&#357;ou je vlo&#382;ený jeden znak <code>R</code>.</li>      <li>Ak je násobnos&#357; atómu iná ne&#382; 1, je to indikované za symbolom atómu symbolom <code>x&#268;ÍSLO</code>, kde <code>&#268;ÍSLO</code> je násobnos&#357; atómu.</li>      <li>Aromatické väzby sú indikované písmenom <code>A</code> za svojim popisom.</li>    </ul>    <p>Po jednotlivých polo&#382;kách se mô&#382;ete pohybova&#357; bu&#271; &scaron;tandardne naviga&#269;nými klávesmi Firefoxu <code>TAB</code> a <code>Shift+TAB</code>, alebo pomocou niektorého z&nbsp;naviga&#269;ných klávesov aplikácie:</p>    <table>      <tr><td><code>Control+A</code></td><td>sko&#269;i&#357; na atómy molekuly;          s&nbsp;pomocou tohto klávesu mô&#382;ete prejs&#357; od mena molekuly priamo na          zoznam atómov a fragmentov bez nutnosti prechádza&#357; vlastnosti molekuly</td></tr>      <tr><td><code>Control+N</code></td><td>prejs&#357; na nasledujúci atóm</td></tr>      <tr><td><code>Control+P</code></td><td>prejs&#357; na predchádzajúci atóm</td></tr>      <tr><td><code>Alt+M</code></td><td>sko&#269;i&#357; na vstupné polí&#269;ko pre zadanie molekuly alebo reakcie</td></tr>      <tr><td><code>Alt+G</code></td><td>prepnú&#357; zobrazovanie fragmentov</td></tr>    </table>    <p>Ak stla&#269;íte kláves <code>Enter</code> na ktoromko&#318;vek atóme      v&nbsp;zozname susedov, je zaostrená polo&#382;ka odpovedajúca tomuto atómu.</p>    <p>Ak zobrazená molekula obsahuje nejaké fragmenty, je na konci stránky      pridané za&scaron;krtávajúce polí&#269;ko.  To umo&#382;&#328;uje prepínanie medzi zobrazovaním      skupín atómov (fragmentov) súhrnnými polo&#382;kami a zobrazovaním v&scaron;etkých jednotlivých atómov.</p>    <p>Ak sa prehliada chemická reakcia a nie iba jednotlivá molekula, zobrazené informácie sú o&nbsp;trochu komplikovanej&scaron;ie.  Najprv je na za&#269;iatku uvedený zoznam reaktantov, reagentov a produktov. Na mene      ktorejko&#318;vek z&nbsp;tejto &#269;asti reakcie mô&#382;ete stla&#269;i&#357; kláves <code>Enter</code> a presunú&#357; sa tak na prehliadanie príslu&scaron;nej molekuly.  Molekuly reakcie sú iná&#269; zobrazené rovnakým spôsobom ako pri prehliadaní      jednotlivej molekuly.</p>    <p>Pri prehliadaní chemickej reakcie sú naviac k&nbsp;dispozícii &#271;al&scaron;ie naviga&#269;né klávesy.  Klávesové príkazy pre pohyb po atómoch obmedzujú pohyb iba na práve prehliadanú molekulu.  Pre pohyb medzi molekulami slú&#382;ia tieto klávesy:</p>        <table>      <tr><td><code>Control+&scaron;ípka dole</code></td><td>prejs&#357; na nasledujúcu zobrazenú molekulu</td></tr>      <tr><td><code>Control+&scaron;ípka hore</code></td><td>prejs&#357; na predchádzajúcu zobrazenú molekulu</td></tr>      <tr><td><code>Control+T</code></td><td>sko&#269;i&#357; spä&#357; na preh&#318;ad reakcie</td></tr>    </table>        <a name="periodic-table">      <h2>Periodická tabu&#318;ka</h2>    </a>    <p>Periodická tabu&#318;ka poskytuje informácie o&nbsp;prvkoch, ich      vlastnostiach a vz&#357;ahoch medzi prvkami. Mô&#382;ete sa po nej pohybova&#357; pomocou      kurzorových klávesov stla&#269;ených spolu s&nbsp;klávesom <code>Shift</code>.  Stla&#269;ením klávesu <code>Enter</code> na tla&#269;idle prvku si mô&#382;ete zobrazi&#357; kompletné informácie o&nbsp;danom prvku.</p>    <p>Periodická tabu&#318;ka je pre &#318;ah&scaron;iu orientáciu tradi&#269;ným spôsobom rozdelená do dvoch samostatných &#269;astí: hlavná tabu&#318;ka a tabu&#318;ka lanthanoidov a actinoidov.  Medzi týmito tabu&#318;kami je mo&#382;né prechádza&#357; s&nbsp;pomocou klávesov <code>Control+T</code> (prechod do hlavnej tabu&#318;ky) a <code>Control+Shift+T</code> (prechod do tabu&#318;ky lanthanoidov a actinoidov). <p>Preh&#318;ad základných klávesových príkazov periodickej tabu&#318;ky:</p>    <table>      <tr><td><code>Shift+kurzorové klávesy</code></td><td>pohyb po prvkoch v&nbsp;periodickej tabuľke</td></tr>      <tr><td><code>Control+T</code></td><td>sko&#269;iť na hlavnú &#269;asť periodickej tabuľky</td></tr>      <tr><td><code>Control+Shift+T</code></td><td>sko&#269;iť na tabuľku lanthanoidov a actinoidov</td></tr>      <tr><td><code>Control+E</code></td><td>sko&#269;iť na zadaný prvok</td></tr>    </table>    <p>Pohyb po tabuľke je možné obmedziť pomocou filtrov.  Filtre môžu obmedziť dostupné prvky iba na tie, které zodpovedajú zadaným vlastnostiam (ako je   napríklad skupina alebo oxidačné číslo).  Filtre se zapínajú      v&nbsp;zozname filtrov, ktorý se nachádza pod periodickou tabuľkou.  Ak je aktivovaných viac filtrov, sú dostupné iba tie prvky, ktoré odpovedajú  všetkým po&#382;adovaným vlastnostiam.  Filtrovanie ako celok môže byť zapnuté alebo      vypnuté za&scaron;krtávacím polí&#269;kom v&nbsp;nastavení filtrov.</p>    <p>Pre prácu s&nbsp;filtrami sú definované nasledovné klávesové príkazy:</p>
<table>      <tr><td><code>Control+F bodka</code></td><td>prejsť na filtre</td></tr>      <tr><td><code>Control+F E</code></td><td>prejsť na filter podľa elektronegativity</td></tr>      <tr><td><code>Control+F G</code></td><td>prejsť na filter podľa skupiny</td></tr>      <tr><td><code>Control+F O</code></td><td>prejsť na filter podľa oxida&#269;ného &#269;ísla</td></tr>      <tr><td><code>Control+F S</code></td><td>prejsť na filter vybraných prvkov</td></tr>      <tr><td><code>Control+F ?</code></td><td>ukázať aktuálne aktívne prvky</td></tr>    </table>    <p>Tieto príkazy pozostávajú z postupnosti viacerých klávesov.  Najprv stlačte      klávesovú kombináciu <code>Control+F</code> a potom (samostatne) druhý      uvedený kláves.</p>    <p>Zvláštnym filtrom je filter <em>Mno&#382;ina prvkov</em>.  Tento filter je aktivovaný stlačením tla&#269;idla <samp>Zmeniť</samp> v&nbsp;nastavení filtrov.  To vykoná preskok do periodickej tabuľky, kde je mo&#382;né pridávat alebo odoberať filtrované prvky stlačením klávesu <code>Enter</code> na ich tla&#269;idlách.  K&nbsp;tomu sú definované ešte tieto klávesové príkazy:</p>        <table>      <tr><td><code>Control+S bodka</code></td><td>ukon&#269;iť výber prvkov a aktivovat filter</td></tr>      <tr><td><code>Control+S A</code></td><td>vybrať v&scaron;etky aktuálne aktívne prvky</td></tr>      <tr><td><code>Control+S N</code></td><td>vyradit v&scaron;etky prvky z&nbsp;výberu</td></tr>    </table>    <a name="keys">      <h2>Prehľad klávesových príkazov</h2>    </a>    <h3>Globálne</h3>    <table>      <tr><td><code>Control+Q</code></td><td>zavrieť okno Brailchemu</td></tr>    </table>    <h3>Prehľad molekúl</h3>    <table>      <tr><td><code>Enter</code></td><td>nasledovať odkaz</td></tr>      <tr><td><code>Control+A</code></td><td>sko&#269;iť na atómy molekuly</td></tr>      <tr><td><code>Control+N</code></td><td>prejsť na nasledujúci atóm v&nbsp;rámci molekuly</td></tr>      <tr><td><code>Control+P</code></td><td>prejsť na predchádzajúci atóm v&nbsp;rámci molekuly</td></tr>      <tr><td><code>Control+&scaron;ípka dolu</code></td><td>prejsť na nasledujúcu zobrazenú molekulu</td></tr>      <tr><td><code>Control+&scaron;ípka hore</code></td><td>prejsť na predchádzajúcu zobrazenú molekulu</td></tr>      <tr><td><code>Control+T</code></td><td>sko&#269;iť späť na prehľad reakcie</td></tr>      <tr><td><code>Alt+M</code></td><td>skočiť na vstupné políčko pre zadanie molekuly alebo reakce</td></tr>      <tr><td><code>Alt+G</code></td><td>prepnúť zobrazovanie fragmentov</td></tr>    </table>        <h3>Periodická tabuľka</h3>    <table>      <tr><td><code>Shift+kurzorové klávesy</code></td><td>pohyb po prvkoch v&nbsp;periodickej tabuľce</td></tr>      <tr><td><code>Control+T</code></td><td>sko&#269;iť na hlavnú &#269;asť periodickej tabuľky</td></tr>      <tr><td><code>Control+Shift+T</code></td><td>sko&#269;iť na tabuľku lanthanoidov a actinoidov</td></tr>      <tr><td><code>Control+E</code></td><td>sko&#269;iť na zadaný prvok</td></tr>      <tr><td><code>Control+F bodka</code></td><td>prejsť na filtre</td></tr>      <tr><td><code>Control+F E</code></td><td>prejsť na filter podľa elektronegativity</td></tr>      <tr><td><code>Control+F G</code></td><td>prejsť na filter podľa skupiny</td></tr>      <tr><td><code>Control+F O</code></td><td>prejsť na filter podľa oxida&#269;ného &#269;ísla</td></tr>      <tr><td><code>Control+F S</code></td><td>prejsť na filter vybraných prvkov</td></tr>      <tr><td><code>Control+F ?</code></td><td>ukázať aktuálne aktívne prvky</td></tr>      <tr><td><code>Control+S bodka</code></td><td>ukon&#269;iť výber prvkov a aktivovat filter</td></tr>      <tr><td><code>Control+S A</code></td><td>vybrať v&scaron;etky aktuálne aktívne prvky</td></tr>      <tr><td><code>Control+S N</code></td><td>vyradit v&scaron;etky prvky z&nbsp;výberu</td></tr>    </table>  </body></html>